---
kind: property
id: P:Autodesk.Revit.DB.OrdinateDimensionSetting.IsValidObject
source: html/ab60e1f9-b6d7-28d4-e568-e8a340f256b2.htm
---
# Autodesk.Revit.DB.OrdinateDimensionSetting.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.